[Killed] UnaryOperator
src/LeadTime.ts:32:12
     }
 
     this.pulls = pulls.filter(
-      p => +new Date(p.merged_at) > this.today.valueOf() - 31 * ONE_DAY
+      p => -new Date(p.merged_at) > this.today.valueOf() - 31 * ONE_DAY
     )
     this.releases = releases.map(r => {
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: expected +0 to be 8 // Object.is equality

[Survived] StringLiteral
src/LeadTime.ts:54:21
     }
 
     if (filtered) {
-      this.log.push(`\nLog is filtered - only feat and fix.`)
+      this.log.push(``)
     }
 
