[Killed] CallExpression
src/LeadTime.ts:102:9
         )
 
         const leadTime = (deployTime - commitTime) / ONE_DAY
-        leadTimes.push(leadTime)
+        ;
         this.log.push(`  ${leadTime.toFixed(2)} days`)
       }
killedBy: LeadTime should return 8 on pull-requests with base.ref = main
statusReason: expected +0 to be 8 // Object.is equality
