[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:38:9
     this.issues = issues
     this.releases = releases
     this.bugLabel = bugLabel
-    if (this.releases === null || this.releases.length === 0) {
+    if (false) {
       throw new Error('Empty release list')
     }
killedBy: MeanTimeToRestore should throw error when empty release list
statusReason: expected [Function m] to throw an error

[Killed] EqualityOperator
src/MeanTimeToRestore.ts:38:35
     this.issues = issues
     this.releases = releases
     this.bugLabel = bugLabel
-    if (this.releases === null || this.releases.length === 0) {
+    if (this.releases === null || this.releases.length !== 0) {
       throw new Error('Empty release list')
     }
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: Empty release list

[Killed] StringLiteral
src/MeanTimeToRestore.ts:60:49
     for (const bug of bugs) {
       const createdAt = +new Date(bug.created_at)
       const closedAt = +new Date(bug.closed_at as string)
-      const repoName = bug.repository_url.split('/').reverse()[0]
+      const repoName = bug.repository_url.split("").reverse()[0]
       if (
         bug.closed_at != null &&
killedBy: MeanTimeToRestore should get mttr for 2 bugs on two repos when no release after bug 1
statusReason: expected 4.5 to be 6 // Object.is equality

[Killed] LogicalOperator
src/MeanTimeToRestore.ts:62:9
       const closedAt = +new Date(bug.closed_at as string)
       const repoName = bug.repository_url.split('/').reverse()[0]
       if (
-        bug.closed_at != null &&
-        this.hasLaterRelease(closedAt, repoName) &&
-        this.hasPreviousRelease(createdAt, repoName)
+        bug.closed_at != null && this.hasLaterRelease(closedAt, repoName) || this.hasPreviousRelease(createdAt, repoName)
       ) {
         values.push({
killedBy: MeanTimeToRestore should get mttr for bug 1 when no release after bug 2
statusReason: No later releases

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:62:9
       const closedAt = +new Date(bug.closed_at as string)
       const repoName = bug.repository_url.split('/').reverse()[0]
       if (
-        bug.closed_at != null &&
-        this.hasLaterRelease(closedAt, repoName) &&
-        this.hasPreviousRelease(createdAt, repoName)
+        false
       ) {
         values.push({
killedBy: MeanTimeToRestore should get bugs last month
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/MeanTimeToRestore.ts:78:38
 
   private getIssuesTaggedAsBug(): Issue[] {
     const bugs: Issue[] = []
-    for (const issue of this.issues) {
-      const createdAt = +new Date(issue.created_at)
-      if (
-        issue.labels.filter(label => label.name === this.bugLabel).length > 0 &&
-        createdAt > this.today.getTime() - 30 * ONE_DAY
-      ) {
-        bugs.push(issue)
-      }
-    }
+    for (const issue of this.issues) {}
     return bugs
   }
killedBy: MeanTimeToRestore should get bugs last month
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:81:9
     for (const issue of this.issues) {
       const createdAt = +new Date(issue.created_at)
       if (
-        issue.labels.filter(label => label.name === this.bugLabel).length > 0 &&
-        createdAt > this.today.getTime() - 30 * ONE_DAY
+        false
       ) {
         bugs.push(issue)
killedBy: MeanTimeToRestore should get bugs last month
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:81:9
     for (const issue of this.issues) {
       const createdAt = +new Date(issue.created_at)
       if (
-        issue.labels.filter(label => label.name === this.bugLabel).length > 0 &&
-        createdAt > this.today.getTime() - 30 * ONE_DAY
+        true
       ) {
         bugs.push(issue)
killedBy: MeanTimeToRestore should get bugs last month
statusReason: expected 20 to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/MeanTimeToRestore.ts:82:44
       const createdAt = +new Date(issue.created_at)
       if (
         issue.labels.filter(label => label.name === this.bugLabel).length > 0 &&
-        createdAt > this.today.getTime() - 30 * ONE_DAY
+        createdAt > this.today.getTime() - 30 / ONE_DAY
       ) {
         bugs.push(issue)
killedBy: MeanTimeToRestore should get bugs last month
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/MeanTimeToRestore.ts:82:9
       const createdAt = +new Date(issue.created_at)
       if (
         issue.labels.filter(label => label.name === this.bugLabel).length > 0 &&
-        createdAt > this.today.getTime() - 30 * ONE_DAY
+        createdAt <= this.today.getTime() - 30 * ONE_DAY
       ) {
         bugs.push(issue)
killedBy: MeanTimeToRestore should get bugs last month
statusReason: expected +0 to be 2 // Object.is equality

[Killed] CallExpression
src/MeanTimeToRestore.ts:84:9
         issue.labels.filter(label => label.name === this.bugLabel).length > 0 &&
         createdAt > this.today.getTime() - 30 * ONE_DAY
       ) {
-        bugs.push(issue)
+        ;
       }
     }
killedBy: MeanTimeToRestore should get bugs last month
statusReason: expected +0 to be 2 // Object.is equality

[Killed] StringLiteral
src/MeanTimeToRestore.ts:103:23
     )
 
     if (rdates.length === 0) {
-      throw new Error('No previous releases')
+      throw new Error("")
     }
 
killedBy: MeanTimeToRestore should throw error when no earlier dates
statusReason: expected [Function t] to throw error including 'No previous releases' but got ''

[Killed] ConditionalExpression
src/MeanTimeToRestore.ts:111:12
 
   getReleaseAfter(date: number, repo: string): ReleaseDate {
     const rdates: ReleaseDate[] = this.releaseDates.filter(
-      r => r.published > date && r.url.includes(repo)
+      r => false
     )
 
killedBy: MeanTimeToRestore should find release time after date
statusReason: No later releases

[Killed] LogicalOperator
src/MeanTimeToRestore.ts:111:12
 
   getReleaseAfter(date: number, repo: string): ReleaseDate {
     const rdates: ReleaseDate[] = this.releaseDates.filter(
-      r => r.published > date && r.url.includes(repo)
+      r => r.published > date || r.url.includes(repo)
     )
 
killedBy: MeanTimeToRestore should find release time after date
statusReason: expected 1681338804000 to be 1682749116000 // Object.is equality

[Killed] EqualityOperator
src/MeanTimeToRestore.ts:123:37
 
   hasLaterRelease(date: number, repo: string): boolean {
     return (
-      this.releaseDates.filter(r => r.published > date && r.url.includes(repo))
+      this.releaseDates.filter(r => r.published >= date && r.url.includes(repo))
         .length > 0
     )
killedBy: MeanTimeToRestore should check if there are later releases
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/MeanTimeToRestore.ts:149:24
       sum += ttrElement
     }
 
-    return Math.round((sum / ttr.length / ONE_DAY) * 100) / 100 // Two decimals
+    return Math.round((sum * ttr.length / ONE_DAY) * 100) / 100 // Two decimals
   }
 }
killedBy: MeanTimeToRestore should get mttr for 2 bugs when release after bug 2
statusReason: expected 20 to be 5 // Object.is equality
