[Killed] LogicalOperator
src/index.ts:58:30
     const logging: string | undefined = core.getInput('logging')
     const filtered: boolean | undefined =
       core.getInput('filtered') === 'true' ? true : false
-    const bugLabel: string = core.getInput('bug-label') || 'bug'
+    const bugLabel: string = core.getInput('bug-label') && 'bug'
 
     const rel = new ReleaseAdapter(token, owner, repositories)
killedBy: run should pass the 'bug-label' input to ChangeFailureRate and MeanTimeToRestore
statusReason: expected "vi.fn()" to be called with arguments: [ [ {} ], [ {} ], null, 'incident' ]

Received:

  1st vi.fn() call:

@@ -4,7 +4,7 @@
    ],

[Killed] StringLiteral
src/index.ts:58:44
     const logging: string | undefined = core.getInput('logging')
     const filtered: boolean | undefined =
       core.getInput('filtered') === 'true' ? true : false
-    const bugLabel: string = core.getInput('bug-label') || 'bug'
+    const bugLabel: string = core.getInput("") || 'bug'
 
     const rel = new ReleaseAdapter(token, owner, repositories)
killedBy: run should pass the 'bug-label' input to ChangeFailureRate and MeanTimeToRestore
statusReason: expected "vi.fn()" to be called with arguments: [ 'bug-label' ]

Received:

  1st vi.fn() call:

  [
-   "bug-label",

[Killed] StringLiteral
src/index.ts:63:20
     const rel = new ReleaseAdapter(token, owner, repositories)
     const releaseList = (await rel.GetAllReleasesLastMonth()) as Release[]
     const df = new DeployFrequency(releaseList)
-    core.setOutput('deploy-rate', df.rate())
+    core.setOutput("", df.rate())
     if (logging === 'true') {
       core.setOutput('deploy-rate-log', df.getLog().join('\n'))
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: expected "vi.fn()" to be called with arguments: [ 'deploy-rate', 5 ]

Received:

  1st vi.fn() call:

  [
-   "deploy-rate",

[Killed] ConditionalExpression
src/index.ts:64:9
     const releaseList = (await rel.GetAllReleasesLastMonth()) as Release[]
     const df = new DeployFrequency(releaseList)
     core.setOutput('deploy-rate', df.rate())
-    if (logging === 'true') {
+    if (false) {
       core.setOutput('deploy-rate-log', df.getLog().join('\n'))
     }
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: expected "vi.fn()" to be called with arguments: [ 'deploy-rate-log', 'log1\nlog2' ]

Received:

  1st vi.fn() call:

  [
-   "deploy-rate-log",

[Killed] StringLiteral
src/index.ts:65:58
     const df = new DeployFrequency(releaseList)
     core.setOutput('deploy-rate', df.rate())
     if (logging === 'true') {
-      core.setOutput('deploy-rate-log', df.getLog().join('\n'))
+      core.setOutput('deploy-rate-log', df.getLog().join(""))
     }
 
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: expected "vi.fn()" to be called with arguments: [ 'deploy-rate-log', 'log1\nlog2' ]

Received:

  1st vi.fn() call:

  [
-   "deploy-rate-log",

[Killed] BlockStatement
src/index.ts:74:29
     const lt = new LeadTime(pulls, releaseList, commits)
     const leadTime = await lt.getLeadTime(filtered)
     core.setOutput('lead-time', leadTime)
-    if (logging === 'true') {
-      core.setOutput('lead-time-log', lt.getLog().join('\n'))
-    }
+    if (logging === 'true') {}
 
     const issueAdapter = new IssuesAdapter(token, owner, repositories)
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: expected "vi.fn()" to be called with arguments: [ 'lead-time-log', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "lead-time-log",

[Killed] StringLiteral
src/index.ts:75:22
     const leadTime = await lt.getLeadTime(filtered)
     core.setOutput('lead-time', leadTime)
     if (logging === 'true') {
-      core.setOutput('lead-time-log', lt.getLog().join('\n'))
+      core.setOutput("", lt.getLog().join('\n'))
     }
 
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: expected "vi.fn()" to be called with arguments: [ 'lead-time-log', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "lead-time-log",

[Killed] BlockStatement
src/index.ts:81:20
     const issueAdapter = new IssuesAdapter(token, owner, repositories)
     const issueList: Issue[] | undefined =
       await issueAdapter.GetAllIssuesLastMonth()
-    if (issueList) {
-      const cfr = new ChangeFailureRate(issueList, releaseList, null, bugLabel)
-      core.setOutput('change-failure-rate', cfr.Cfr())
-      const mttr = new MeanTimeToRestore(issueList, releaseList, null, bugLabel)
-      core.setOutput('mttr', mttr.mttr())
-    } else {
+    if (issueList) {} else {
       core.setOutput('change-failure-rate', 'empty issue list')
       core.setOutput('mttr', 'empty issue list')
killedBy: run should set correct outputs for deploy-rate, lead-time, and logs
statusReason: expected "vi.fn()" to be called with arguments: [ 'change-failure-rate', 0.1 ]

Received:

  1st vi.fn() call:

  [
-   "change-failure-rate",

[Killed] StringLiteral
src/index.ts:88:30
       core.setOutput('mttr', mttr.mttr())
     } else {
       core.setOutput('change-failure-rate', 'empty issue list')
-      core.setOutput('mttr', 'empty issue list')
+      core.setOutput('mttr', "")
     }
   } catch (error: any) {
killedBy: run should handle empty issue list case
statusReason: expected "vi.fn()" to be called with arguments: [ 'mttr', 'empty issue list' ]

Received:

  1st vi.fn() call:

  [
-   "mttr",

[Killed] CallExpression
src/index.ts:91:5
       core.setOutput('mttr', 'empty issue list')
     }
   } catch (error: any) {
-    core.setFailed(error.message)
+    ;
   }
 }
killedBy: run should handle errors and set failure
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to fetch releases' ]

Number of calls: 0
