[Killed] CallExpression
src/CommitsAdapter.ts:23:7
 
       return result
     } catch (e: any) {
-      core.setFailed(e.message)
+      ;
     }
   }
killedBy: CommitsAdapter should handle missing or incorrect headers
statusReason: expected "vi.fn()" to be called with arguments: [ 'Incorrect headers' ]

Number of calls: 0
