[Killed] StringLiteral
src/ChangeFailureRate.ts:15:16
     issues: Issue[],
     releases: Release[],
     today: Date | null = null,
-    bugLabel = 'bug'
+    bugLabel = ""
   ) {
     this.today = today === null ? new Date() : today
killedBy: ChangeFailureRate should get number of bugs created
statusReason: expected +0 to be 2 // Object.is equality

[Killed] MethodExpression
src/ChangeFailureRate.ts:20:21
     this.today = today === null ? new Date() : today
     this.issues = issues
     this.bugLabel = bugLabel
-    this.releases = releases
-      .sort((a, b) =>
-        +new Date(a.published_at) < +new Date(b.published_at) ? -1 : 1
-      )
+    this.releases = releases
       .filter(
         r =>
killedBy: ChangeFailureRate should calculate 100% failures on 2 issues after latest release and one before
statusReason: expected 50 to be 100 // Object.is equality

[Killed] MethodExpression
src/ChangeFailureRate.ts:20:21
     this.today = today === null ? new Date() : today
     this.issues = issues
     this.bugLabel = bugLabel
-    this.releases = releases
-      .sort((a, b) =>
-        +new Date(a.published_at) < +new Date(b.published_at) ? -1 : 1
-      )
-      .filter(
-        r =>
-          +new Date(r.published_at) >
-          this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
-      )
+    this.releases = releases.sort((a, b) => +new Date(a.published_at) < +new Date(b.published_at) ? -1 : 1)
     this.repos = []
   }
killedBy: ChangeFailureRate should calculate 0% failures on 1 issues on 1 release when more than a month ago
statusReason: expected 100 to be +0 // Object.is equality

[Killed] UnaryOperator
src/ChangeFailureRate.ts:22:37
     this.bugLabel = bugLabel
     this.releases = releases
       .sort((a, b) =>
-        +new Date(a.published_at) < +new Date(b.published_at) ? -1 : 1
+        +new Date(a.published_at) < -new Date(b.published_at) ? -1 : 1
       )
       .filter(
killedBy: ChangeFailureRate should calculate 100% failures on 2 issues after latest release and one before
statusReason: expected 50 to be 100 // Object.is equality

[Killed] UnaryOperator
src/ChangeFailureRate.ts:26:11
       )
       .filter(
         r =>
-          +new Date(r.published_at) >
+          -new Date(r.published_at) >
           this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
       )
killedBy: ChangeFailureRate should get percentage rate
statusReason: expected +0 to be 14 // Object.is equality

[Killed] ConditionalExpression
src/ChangeFailureRate.ts:26:11
       )
       .filter(
         r =>
-          +new Date(r.published_at) >
-          this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
+          true
       )
     this.repos = []
killedBy: ChangeFailureRate should calculate 0% failures on 1 issues on 1 release when more than a month ago
statusReason: expected 100 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/ChangeFailureRate.ts:27:34
       .filter(
         r =>
           +new Date(r.published_at) >
-          this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
+          this.today.valueOf() - 31 / 24 * 60 * 60 * 1000
       )
     this.repos = []
killedBy: ChangeFailureRate should get percentage rate
statusReason: expected +0 to be 14 // Object.is equality

[Killed] ArithmeticOperator
src/ChangeFailureRate.ts:27:11
       .filter(
         r =>
           +new Date(r.published_at) >
-          this.today.valueOf() - 31 * 24 * 60 * 60 * 1000
+          this.today.valueOf() + 31 * 24 * 60 * 60 * 1000
       )
     this.repos = []
killedBy: ChangeFailureRate should get percentage rate
statusReason: expected +0 to be 14 // Object.is equality

[Killed] BlockStatement
src/ChangeFailureRate.ts:34:38
 
   getBugs(): Issue[] {
     const bugs: Issue[] = []
-    for (const issue of this.issues) {
-      if (
-        issue.labels.filter(label => label.name === this.bugLabel).length > 0
-      ) {
-        bugs.push(issue)
-      }
-    }
+    for (const issue of this.issues) {}
 
     return bugs
killedBy: ChangeFailureRate should get number of bugs created
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/ChangeFailureRate.ts:36:38
     const bugs: Issue[] = []
     for (const issue of this.issues) {
       if (
-        issue.labels.filter(label => label.name === this.bugLabel).length > 0
+        issue.labels.filter(label => true).length > 0
       ) {
         bugs.push(issue)
killedBy: ChangeFailureRate should get number of bugs created
statusReason: expected 17 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/ChangeFailureRate.ts:36:9
     const bugs: Issue[] = []
     for (const issue of this.issues) {
       if (
-        issue.labels.filter(label => label.name === this.bugLabel).length > 0
+        true
       ) {
         bugs.push(issue)
killedBy: ChangeFailureRate should get number of bugs created
statusReason: expected 30 to be 2 // Object.is equality

[Killed] BlockStatement
src/ChangeFailureRate.ts:37:9
     for (const issue of this.issues) {
       if (
         issue.labels.filter(label => label.name === this.bugLabel).length > 0
-      ) {
-        bugs.push(issue)
-      }
+      ) {}
     }
 
killedBy: ChangeFailureRate should get number of bugs created
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/ChangeFailureRate.ts:46:37
   }
 
   Cfr(): number {
-    if (this.issues.length === 0 || this.releases.length === 0) {
+    if (this.issues.length === 0 || this.releases.length !== 0) {
       return 0
     }
killedBy: ChangeFailureRate should get percentage rate
statusReason: expected +0 to be 14 // Object.is equality

[Killed] CallExpression
src/ChangeFailureRate.ts:54:9
     for (const bug of bugs) {
       const repo = bug.repository_url.split('/').reverse()[0]
       if (!this.repos.includes(repo)) {
-        this.repos.push(repo)
+        ;
       }
     }
killedBy: ChangeFailureRate should get percentage rate
statusReason: expected +0 to be 14 // Object.is equality

[Killed] UpdateOperator
src/ChangeFailureRate.ts:68:55
     let failedDeploys = 0
     for (const repo of this.repos) {
       const releasesForRepo = releaseDates.filter(r => r.url.includes(repo))
-      for (let i = 0; i < releasesForRepo.length - 1; i++) {
+      for (let i = 0; i < releasesForRepo.length - 1; i--) {
         if (
           bugs.filter(function (bug) {
killedBy: ChangeFailureRate should get percentage rate
statusReason: Cannot read properties of undefined (reading 'published')

[Killed] MethodExpression
src/ChangeFailureRate.ts:71:17
       for (let i = 0; i < releasesForRepo.length - 1; i++) {
         if (
           bugs.filter(function (bug) {
-            if (bug.repository_url.split('/').reverse()[0] !== repo) {
+            if (bug.repository_url.split('/')[0] !== repo) {
               return false
             }
killedBy: ChangeFailureRate should get percentage rate
statusReason: expected +0 to be 14 // Object.is equality

[Killed] EqualityOperator
src/ChangeFailureRate.ts:76:15
             }
             const bugDate = +new Date(bug.created_at)
             return (
-              bugDate > releasesForRepo[i].published &&
+              bugDate <= releasesForRepo[i].published &&
               bugDate < releasesForRepo[i + 1].published
             )
killedBy: ChangeFailureRate should get percentage rate
statusReason: expected 71 to be 14 // Object.is equality

[Killed] ConditionalExpression
src/ChangeFailureRate.ts:77:15
             const bugDate = +new Date(bug.created_at)
             return (
               bugDate > releasesForRepo[i].published &&
-              bugDate < releasesForRepo[i + 1].published
+              true
             )
           }).length > 0
killedBy: ChangeFailureRate should get percentage rate
statusReason: expected 29 to be 14 // Object.is equality
